k6/results/tobe_coupon_issue.txt

         /\      Grafana   /?얄?  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ?얄? 
  /          \   |   (  |  (??  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/coupon_issue.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 1m20s over 8 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.8s), 0001/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 0001/1000 VUs  0m00.8s/1m20.0s

running (0m01.8s), 0002/1000 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 0002/1000 VUs  0m01.8s/1m20.0s

running (0m02.8s), 0003/1000 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 0003/1000 VUs  0m02.8s/1m20.0s

running (0m03.8s), 0004/1000 VUs, 4 complete and 0 interrupted iterations
default   [   5% ] 0004/1000 VUs  0m03.8s/1m20.0s

running (0m04.8s), 0005/1000 VUs, 7 complete and 0 interrupted iterations
default   [   6% ] 0005/1000 VUs  0m04.8s/1m20.0s

running (0m05.8s), 0006/1000 VUs, 8 complete and 0 interrupted iterations
default   [   7% ] 0006/1000 VUs  0m05.8s/1m20.0s

running (0m06.8s), 0007/1000 VUs, 9 complete and 0 interrupted iterations
default   [   9% ] 0007/1000 VUs  0m06.8s/1m20.0s

running (0m07.8s), 0008/1000 VUs, 14 complete and 0 interrupted iterations
default   [  10% ] 0008/1000 VUs  0m07.8s/1m20.0s

running (0m08.8s), 0008/1000 VUs, 16 complete and 0 interrupted iterations
default   [  11% ] 0008/1000 VUs  0m08.8s/1m20.0s

running (0m09.8s), 0009/1000 VUs, 20 complete and 0 interrupted iterations
default   [  12% ] 0009/1000 VUs  0m09.8s/1m20.0s

running (0m10.8s), 0010/1000 VUs, 25 complete and 0 interrupted iterations
default   [  14% ] 0010/1000 VUs  0m10.8s/1m20.0s

running (0m11.8s), 0010/1000 VUs, 28 complete and 0 interrupted iterations
default   [  15% ] 0010/1000 VUs  0m11.8s/1m20.0s

running (0m12.8s), 0010/1000 VUs, 34 complete and 0 interrupted iterations
default   [  16% ] 0010/1000 VUs  0m12.8s/1m20.0s

running (0m13.8s), 0010/1000 VUs, 39 complete and 0 interrupted iterations
default   [  17% ] 0010/1000 VUs  0m13.8s/1m20.0s

running (0m14.8s), 0010/1000 VUs, 43 complete and 0 interrupted iterations
default   [  19% ] 0010/1000 VUs  0m14.8s/1m20.0s

running (0m15.8s), 0010/1000 VUs, 48 complete and 0 interrupted iterations
default   [  20% ] 0010/1000 VUs  0m15.8s/1m20.0s

running (0m16.8s), 0010/1000 VUs, 53 complete and 0 interrupted iterations
default   [  21% ] 0010/1000 VUs  0m16.8s/1m20.0s

running (0m17.8s), 0010/1000 VUs, 57 complete and 0 interrupted iterations
default   [  22% ] 0010/1000 VUs  0m17.8s/1m20.0s

running (0m18.8s), 0010/1000 VUs, 59 complete and 0 interrupted iterations
default   [  24% ] 0010/1000 VUs  0m18.8s/1m20.0s

running (0m19.8s), 0010/1000 VUs, 66 complete and 0 interrupted iterations
default   [  25% ] 0010/1000 VUs  0m19.8s/1m20.0s

running (0m20.8s), 0068/1000 VUs, 69 complete and 0 interrupted iterations
default   [  26% ] 0068/1000 VUs  0m20.8s/1m20.0s

running (0m21.8s), 0137/1000 VUs, 86 complete and 0 interrupted iterations
default   [  27% ] 0137/1000 VUs  0m21.8s/1m20.0s

running (0m22.8s), 0206/1000 VUs, 142 complete and 0 interrupted iterations
default   [  29% ] 0206/1000 VUs  0m22.8s/1m20.0s

running (0m23.8s), 0275/1000 VUs, 234 complete and 0 interrupted iterations
default   [  30% ] 0275/1000 VUs  0m23.8s/1m20.0s

running (0m24.8s), 0344/1000 VUs, 332 complete and 0 interrupted iterations
default   [  31% ] 0344/1000 VUs  0m24.8s/1m20.0s

running (0m25.8s), 0412/1000 VUs, 462 complete and 0 interrupted iterations
default   [  32% ] 0412/1000 VUs  0m25.8s/1m20.0s

running (0m26.8s), 0482/1000 VUs, 595 complete and 0 interrupted iterations
default   [  34% ] 0482/1000 VUs  0m26.8s/1m20.0s

running (0m27.9s), 0552/1000 VUs, 773 complete and 0 interrupted iterations
default   [  35% ] 0552/1000 VUs  0m27.9s/1m20.0s

running (0m28.8s), 0620/1000 VUs, 987 complete and 0 interrupted iterations
default   [  36% ] 0620/1000 VUs  0m28.8s/1m20.0s

running (0m29.8s), 0688/1000 VUs, 1276 complete and 0 interrupted iterations
default   [  37% ] 0688/1000 VUs  0m29.8s/1m20.0s

running (0m30.8s), 0695/1000 VUs, 1598 complete and 0 interrupted iterations
default   [  39% ] 0695/1000 VUs  0m30.8s/1m20.0s

running (0m31.8s), 0658/1000 VUs, 1912 complete and 0 interrupted iterations
default   [  40% ] 0658/1000 VUs  0m31.8s/1m20.0s

running (0m32.8s), 0594/1000 VUs, 2230 complete and 0 interrupted iterations
default   [  41% ] 0594/1000 VUs  0m32.8s/1m20.0s

running (0m33.8s), 0511/1000 VUs, 2563 complete and 0 interrupted iterations
default   [  42% ] 0511/1000 VUs  0m33.8s/1m20.0s

running (0m34.8s), 0449/1000 VUs, 2827 complete and 0 interrupted iterations
default   [  44% ] 0449/1000 VUs  0m34.8s/1m20.0s

running (0m35.8s), 0389/1000 VUs, 3039 complete and 0 interrupted iterations
default   [  45% ] 0389/1000 VUs  0m35.8s/1m20.0s

running (0m36.8s), 0320/1000 VUs, 3228 complete and 0 interrupted iterations
default   [  46% ] 0320/1000 VUs  0m36.8s/1m20.0s

running (0m37.8s), 0240/1000 VUs, 3415 complete and 0 interrupted iterations
default   [  47% ] 0240/1000 VUs  0m37.8s/1m20.0s

running (0m38.8s), 0169/1000 VUs, 3550 complete and 0 interrupted iterations
default   [  49% ] 0169/1000 VUs  0m38.8s/1m20.0s

running (0m39.8s), 0110/1000 VUs, 3630 complete and 0 interrupted iterations
default   [  50% ] 0110/1000 VUs  0m39.8s/1m20.0s

running (0m40.8s), 0036/1000 VUs, 3710 complete and 0 interrupted iterations
default   [  51% ] 0036/1000 VUs  0m40.8s/1m20.0s

running (0m41.8s), 0016/1000 VUs, 3736 complete and 0 interrupted iterations
default   [  52% ] 0016/1000 VUs  0m41.8s/1m20.0s

running (0m42.8s), 0010/1000 VUs, 3745 complete and 0 interrupted iterations
default   [  54% ] 0010/1000 VUs  0m42.8s/1m20.0s

running (0m43.8s), 0010/1000 VUs, 3750 complete and 0 interrupted iterations
default   [  55% ] 0010/1000 VUs  0m43.8s/1m20.0s

running (0m44.8s), 0010/1000 VUs, 3756 complete and 0 interrupted iterations
default   [  56% ] 0010/1000 VUs  0m44.8s/1m20.0s

running (0m45.8s), 0010/1000 VUs, 3762 complete and 0 interrupted iterations
default   [  57% ] 0010/1000 VUs  0m45.8s/1m20.0s

running (0m46.8s), 0010/1000 VUs, 3766 complete and 0 interrupted iterations
default   [  59% ] 0010/1000 VUs  0m46.8s/1m20.0s

running (0m47.8s), 0010/1000 VUs, 3769 complete and 0 interrupted iterations
default   [  60% ] 0010/1000 VUs  0m47.8s/1m20.0s

running (0m48.8s), 0010/1000 VUs, 3776 complete and 0 interrupted iterations
default   [  61% ] 0010/1000 VUs  0m48.8s/1m20.0s

running (0m49.8s), 0010/1000 VUs, 3780 complete and 0 interrupted iterations
default   [  62% ] 0010/1000 VUs  0m49.8s/1m20.0s

running (0m50.9s), 0094/1000 VUs, 3782 complete and 0 interrupted iterations
default   [  64% ] 0094/1000 VUs  0m50.9s/1m20.0s

running (0m51.8s), 0192/1000 VUs, 3822 complete and 0 interrupted iterations
default   [  65% ] 0192/1000 VUs  0m51.8s/1m20.0s

running (0m52.8s), 0291/1000 VUs, 3894 complete and 0 interrupted iterations
default   [  66% ] 0291/1000 VUs  0m52.8s/1m20.0s

running (0m53.8s), 0390/1000 VUs, 4018 complete and 0 interrupted iterations
default   [  67% ] 0390/1000 VUs  0m53.8s/1m20.0s

running (0m54.8s), 0489/1000 VUs, 4191 complete and 0 interrupted iterations
default   [  69% ] 0489/1000 VUs  0m54.8s/1m20.0s

running (0m55.8s), 0588/1000 VUs, 4397 complete and 0 interrupted iterations
default   [  70% ] 0588/1000 VUs  0m55.8s/1m20.0s

running (0m56.8s), 0687/1000 VUs, 4666 complete and 0 interrupted iterations
default   [  71% ] 0687/1000 VUs  0m56.8s/1m20.0s

running (0m57.8s), 0786/1000 VUs, 4992 complete and 0 interrupted iterations
default   [  72% ] 0786/1000 VUs  0m57.8s/1m20.0s

running (0m58.8s), 0884/1000 VUs, 5350 complete and 0 interrupted iterations
default   [  74% ] 0884/1000 VUs  0m58.8s/1m20.0s

running (0m59.8s), 0983/1000 VUs, 5746 complete and 0 interrupted iterations
default   [  75% ] 0983/1000 VUs  0m59.8s/1m20.0s

running (1m00.8s), 0991/1000 VUs, 6197 complete and 0 interrupted iterations
default   [  76% ] 0991/1000 VUs  1m00.8s/1m20.0s

running (1m01.8s), 0947/1000 VUs, 6626 complete and 0 interrupted iterations
default   [  77% ] 0947/1000 VUs  1m01.8s/1m20.0s

running (1m02.8s), 0849/1000 VUs, 7121 complete and 0 interrupted iterations
default   [  79% ] 0849/1000 VUs  1m02.8s/1m20.0s

running (1m03.8s), 0759/1000 VUs, 7522 complete and 0 interrupted iterations
default   [  80% ] 0759/1000 VUs  1m03.8s/1m20.0s

running (1m04.8s), 0643/1000 VUs, 7914 complete and 0 interrupted iterations
default   [  81% ] 0643/1000 VUs  1m04.8s/1m20.0s

running (1m05.8s), 0523/1000 VUs, 8271 complete and 0 interrupted iterations
default   [  82% ] 0523/1000 VUs  1m05.8s/1m20.0s

running (1m06.8s), 0440/1000 VUs, 8519 complete and 0 interrupted iterations
default   [  84% ] 0440/1000 VUs  1m06.8s/1m20.0s

running (1m07.8s), 0340/1000 VUs, 8748 complete and 0 interrupted iterations
default   [  85% ] 0340/1000 VUs  1m07.8s/1m20.0s

running (1m08.8s), 0243/1000 VUs, 8924 complete and 0 interrupted iterations
default   [  86% ] 0243/1000 VUs  1m08.8s/1m20.0s

running (1m09.8s), 0136/1000 VUs, 9068 complete and 0 interrupted iterations
default   [  87% ] 0136/1000 VUs  1m09.8s/1m20.0s

running (1m10.8s), 0055/1000 VUs, 9153 complete and 0 interrupted iterations
default   [  89% ] 0055/1000 VUs  1m10.8s/1m20.0s

running (1m11.8s), 0020/1000 VUs, 9190 complete and 0 interrupted iterations
default   [  90% ] 0020/1000 VUs  1m11.8s/1m20.0s

running (1m12.8s), 0008/1000 VUs, 9205 complete and 0 interrupted iterations
default   [  91% ] 0008/1000 VUs  1m12.8s/1m20.0s

running (1m13.8s), 0007/1000 VUs, 9210 complete and 0 interrupted iterations
default   [  92% ] 0007/1000 VUs  1m13.8s/1m20.0s

running (1m14.8s), 0006/1000 VUs, 9213 complete and 0 interrupted iterations
default   [  94% ] 0006/1000 VUs  1m14.8s/1m20.0s

running (1m15.8s), 0006/1000 VUs, 9214 complete and 0 interrupted iterations
default   [  95% ] 0006/1000 VUs  1m15.8s/1m20.0s

running (1m16.8s), 0004/1000 VUs, 9220 complete and 0 interrupted iterations
default   [  96% ] 0004/1000 VUs  1m16.8s/1m20.0s

running (1m17.8s), 0003/1000 VUs, 9222 complete and 0 interrupted iterations
default   [  97% ] 0003/1000 VUs  1m17.8s/1m20.0s

running (1m18.8s), 0003/1000 VUs, 9222 complete and 0 interrupted iterations
default   [  99% ] 0003/1000 VUs  1m18.8s/1m20.0s

running (1m19.8s), 0001/1000 VUs, 9225 complete and 0 interrupted iterations
default   [ 100% ] 0001/1000 VUs  1m19.8s/1m20.0s

running (1m20.8s), 0001/1000 VUs, 9225 complete and 0 interrupted iterations
default ??[ 100% ] 0001/1000 VUs  1m20s

running (1m21.8s), 0001/1000 VUs, 9225 complete and 0 interrupted iterations
default ??[ 100% ] 0001/1000 VUs  1m20s


  ??THRESHOLDS 

    http_req_duration
    ??'p(99)<1000' p(99)=891.99ms

    http_req_failed
    ??'rate<0.05' rate=0.00%


  ??TOTAL RESULTS 

    checks_total.......: 9226    111.562321/s
    checks_succeeded...: 100.00% 9226 out of 9226
    checks_failed......: 0.00%   0 out of 9226

    ??荑좏룿 諛쒓툒 ?깃났

    HTTP
    http_req_duration..............: avg=101.05ms min=2.67ms med=68.28ms max=1.61s p(50)=68.28ms p(90)=204.23ms p(95)=396.49ms p(99)=891.99ms p(99.9)=1.47s
      { expected_response:true }...: avg=101.05ms min=2.67ms med=68.28ms max=1.61s p(50)=68.28ms p(90)=204.23ms p(95)=396.49ms p(99)=891.99ms p(99.9)=1.47s
    http_req_failed................: 0.00%  0 out of 9226
    http_reqs......................: 9226   111.562321/s

    EXECUTION
    iteration_duration.............: avg=2.11s    min=1s     med=2.07s   max=4.58s p(50)=2.07s   p(90)=3.09s    p(95)=3.19s    p(99)=3.6s     p(99.9)=4.28s
    iterations.....................: 9226   111.562321/s
    vus............................: 1      min=1         max=991 
    vus_max........................: 1000   min=1000      max=1000

    NETWORK
    data_received..................: 1.7 MB 20 kB/s
    data_sent......................: 1.6 MB 19 kB/s



running (1m22.7s), 0000/1000 VUs, 9226 complete and 0 interrupted iterations
default ??[ 100% ] 0000/1000 VUs  1m20s