k6/results/tobe_coupon_issue.txt


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(99)<1000' p(99)=2.11s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8087    97.550797/s
    checks_succeeded...: 100.00% 8087 out of 8087
    checks_failed......: 0.00%   0 out of 8087

    ✓ 쿠폰 발급 성공

    HTTP
    http_req_duration..............: avg=442.3ms min=3.61ms med=239.79ms max=2.9s p(50)=239.79ms p(90)=1.15s p(95)=1.49s p(99)=2.11s p(99.9)=2.79s
      { expected_response:true }...: avg=442.3ms min=3.61ms med=239.79ms max=2.9s p(50)=239.79ms p(90)=1.15s p(95)=1.49s p(99)=2.11s p(99.9)=2.79s
    http_req_failed................: 0.00%  0 out of 8087
    http_reqs......................: 8087   97.550797/s

    EXECUTION
    iteration_duration.............: avg=2.45s   min=1s     med=2.4s     max=5.9s p(50)=2.4s     p(90)=3.61s p(95)=3.92s p(99)=4.6s  p(99.9)=5.6s 
    iterations.....................: 8087   97.550797/s
    vus............................: 1      min=1         max=998 
    vus_max........................: 1000   min=1000      max=1000

    NETWORK
    data_received..................: 1.5 MB 18 kB/s
    data_sent......................: 1.4 MB 17 kB/s



time="2026-09-14T17:40:56+09:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"